MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32FG25B221F1920IM56/mcu.h
/* Instance macros for EUSART */
#define EUSART(n)                    (((n) == 0) ? EUSART0   \
                                      : ((n) == 1) ? EUSART1 \
                                      : ((n) == 2) ? EUSART2 \
                                      : ((n) == 3) ? EUSART3 \
                                      : ((n) == 4) ? EUSART4 \
                                      : 0x0UL)
#define EUSART_NUM(ref)              (((ref) == EUSART0) ? 0   \
                                      : ((ref) == EUSART1) ? 1 \
                                      : ((ref) == EUSART2) ? 2 \
                                      : ((ref) == EUSART3) ? 3 \
                                      : ((ref) == EUSART4) ? 4 \
                                      : -1)
#define EUSART_EM2_CAPABLE(n)        (((n) == 0) ? EUSART0_EM2_CAPABLE   \
                                      : ((n) == 1) ? EUSART1_EM2_CAPABLE \
                                      : ((n) == 2) ? EUSART2_EM2_CAPABLE \
                                      : ((n) == 3) ? EUSART3_EM2_CAPABLE \
                                      : ((n) == 4) ? EUSART4_EM2_CAPABLE \
                                      : 0x0UL)
#define EUSART_NOT_EM2_CAPABLE(n)    (((n) == 0) ? EUSART0_NOT_EM2_CAPABLE   \
                                      : ((n) == 1) ? EUSART1_NOT_EM2_CAPABLE \
                                      : ((n) == 2) ? EUSART2_NOT_EM2_CAPABLE \
                                      : ((n) == 3) ? EUSART3_NOT_EM2_CAPABLE \
                                      : ((n) == 4) ? EUSART4_NOT_EM2_CAPABLE \
                                      : 0x0UL)

/* Instance macros for GPCRC */
#define GPCRC_NUM(ref)               (((ref) == GPCRC) ? 0 \
                                      : -1)

/* Instance macros for I2C */
#define I2C(n)                       (((n) == 0) ? I2C0   \
                                      : ((n) == 1) ? I2C1 \
                                      : 0x0UL)
#define I2C_NUM(ref)                 (((ref) == I2C0) ? 0   \
                                      : ((ref) == I2C1) ? 1 \
                                      : -1)
#define I2C_DELAY(n)                 (((n) == 0) ? I2C0_DELAY   \
                                      : ((n) == 1) ? I2C1_DELAY \
                                      : 0x0UL)
#define I2C_DELAY_CHAIN_NUM(n)       (((n) == 0) ? I2C0_DELAY_CHAIN_NUM   \
                                      : ((n) == 1) ? I2C1_DELAY_CHAIN_NUM \
                                      : 0x0UL)

/* Instance macros for IADC */
#define IADC(n)                      (((n) == 0) ? IADC0 \
                                      : 0x0UL)
#define IADC_NUM(ref)                (((ref) == IADC0) ? 0 \
                                      : -1)
#define IADC_CONFIGNUM(n)            (((n) == 0) ? IADC0_CONFIGNUM \
                                      : 0x0UL)
#define IADC_FULLRANGEUNIPOLAR(n)    (((n) == 0) ? IADC0_FULLRANGEUNIPOLAR \
                                      : 0x0UL)
#define IADC_SCANBYTES(n)            (((n) == 0) ? IADC0_SCANBYTES \
                                      : 0x0UL)
#define IADC_ENTRIES(n)              (((n) == 0) ? IADC0_ENTRIES \
                                      : 0x0UL)

/* Instance macros for LDMA */
#define LDMA_NUM(ref)                (((ref) == LDMA) ? 0 \
                                      : -1)

/* Instance macros for LDMAXBAR */
#define LDMAXBAR_NUM(ref)            (((ref) == LDMAXBAR) ? 0 \
                                      : -1)

/* Instance macros for LETIMER */
#define LETIMER(n)                   (((n) == 0) ? LETIMER0 \
                                      : 0x0UL)
#define LETIMER_NUM(ref)             (((ref) == LETIMER0) ? 0 \
                                      : -1)
#define LETIMER_CNT_WIDTH(n)         (((n) == 0) ? LETIMER0_CNT_WIDTH \
                                      : 0x0UL)

/* Instance macros for PCNT */
#define PCNT(n)                      (((n) == 0) ? PCNT0 \
                                      : 0x0UL)
#define PCNT_NUM(ref)                (((ref) == PCNT0) ? 0 \
                                      : -1)
#define PCNT_PCNT_WIDTH(n)           (((n) == 0) ? PCNT0_PCNT_WIDTH \
                                      : 0x0UL)

/* Instance macros for RFFPLL */
#define RFFPLL(n)                    (((n) == 0) ? RFFPLL0 \
                                      : 0x0UL)
#define RFFPLL_NUM(ref)              (((ref) == RFFPLL0) ? 0 \
                                      : -1)

/* Instance macros for TIMER */
#define TIMER(n)                     (((n) == 0) ? TIMER0   \
                                      : ((n) == 1) ? TIMER1 \
                                      : ((n) == 2) ? TIMER2 \
                                      : ((n) == 3) ? TIMER3 \
                                      : ((n) == 4) ? TIMER4 \
                                      : ((n) == 5) ? TIMER5 \
                                      : ((n) == 6) ? TIMER6 \
                                      : ((n) == 7) ? TIMER7 \
                                      : 0x0UL)
#define TIMER_NUM(ref)               (((ref) == TIMER0) ? 0   \
                                      : ((ref) == TIMER1) ? 1 \
                                      : ((ref) == TIMER2) ? 2 \
                                      : ((ref) == TIMER3) ? 3 \
                                      : ((ref) == TIMER4) ? 4 \
                                      : ((ref) == TIMER5) ? 5 \
                                      : ((ref) == TIMER6) ? 6 \
                                      : ((ref) == TIMER7) ? 7 \
                                      : -1)
#define TIMER_CC_NUM(n)              (((n) == 0) ? TIMER0_CC_NUM   \
                                      : ((n) == 1) ? TIMER1_CC_NUM \
                                      : ((n) == 2) ? TIMER2_CC_NUM \
                                      : ((n) == 3) ? TIMER3_CC_NUM \
                                      : ((n) == 4) ? TIMER4_CC_NUM \
                                      : ((n) == 5) ? TIMER5_CC_NUM \
                                      : ((n) == 6) ? TIMER6_CC_NUM \
                                      : ((n) == 7) ? TIMER7_CC_NUM \
                                      : 0x0UL)
#define TIMER_CNTWIDTH(n)            (((n) == 0) ? TIMER0_CNTWIDTH   \
                                      : ((n) == 1) ? TIMER1_CNTWIDTH \
                                      : ((n) == 2) ? TIMER2_CNTWIDTH \
                                      : ((n) == 3) ? TIMER3_CNTWIDTH \
                                      : ((n) == 4) ? TIMER4_CNTWIDTH \
                                      : ((n) == 5) ? TIMER5_CNTWIDTH \
                                      : ((n) == 6) ? TIMER6_CNTWIDTH \
                                      : ((n) == 7) ? TIMER7_CNTWIDTH \
                                      : 0x0UL)
#define TIMER_DTI(n)                 (((n) == 0) ? TIMER0_DTI   \
                                      : ((n) == 1) ? TIMER1_DTI \
                                      : ((n) == 2) ? TIMER2_DTI \
                                      : ((n) == 3) ? TIMER3_DTI \
                                      : ((n) == 4) ? TIMER4_DTI \
                                      : ((n) == 5) ? TIMER5_DTI \
                                      : ((n) == 6) ? TIMER6_DTI \
                                      : ((n) == 7) ? TIMER7_DTI \
                                      : 0x0UL)
#define TIMER_DTI_CC_NUM(n)          (((n) == 0) ? TIMER0_DTI_CC_NUM   \
                                      : ((n) == 1) ? TIMER1_DTI_CC_NUM \
                                      : ((n) == 2) ? TIMER2_DTI_CC_NUM \
                                      : ((n) == 3) ? TIMER3_DTI_CC_NUM \
                                      : ((n) == 4) ? TIMER4_DTI_CC_NUM \
                                      : ((n) == 5) ? TIMER5_DTI_CC_NUM \
                                      : ((n) == 6) ? TIMER6_DTI_CC_NUM \
                                      : ((n) == 7) ? TIMER7_DTI_CC_NUM \
                                      : 0x0UL)
#define TIMER_NO_DTI(n)              (((n) == 0) ? TIMER0_NO_DTI   \
                                      : ((n) == 1) ? TIMER1_NO_DTI \
                                      : ((n) == 2) ? TIMER2_NO_DTI \
                                      : ((n) == 3) ? TIMER3_NO_DTI \
                                      : ((n) == 4) ? TIMER4_NO_DTI \
                                      : ((n) == 5) ? TIMER5_NO_DTI \
                                      : ((n) == 6) ? TIMER6_NO_DTI \
                                      : ((n) == 7) ? TIMER7_NO_DTI \
                                      : 0x0UL)

/* Instance macros for USBPLL */
#define USBPLL(n)                    (((n) == 0) ? USBPLL0 \
                                      : 0x0UL)
#define USBPLL_NUM(ref)              (((ref) == USBPLL0) ? 0 \
                                      : -1)

/* Instance macros for VDAC */
#define VDAC(n)                      (((n) == 0) ? VDAC0 \
                                      : 0x0UL)
#define VDAC_NUM(ref)                (((ref) == VDAC0) ? 0 \
                                      : -1)
#define VDAC_ALT_WIDTH(n)            (((n) == 0) ? VDAC0_ALT_WIDTH \
                                      : 0x0UL)
#define VDAC_CH0_TRIG_LESENSE(n)     (((n) == 0) ? VDAC0_CH0_TRIG_LESENSE \
                                      : 0x0UL)
#define VDAC_CH1_TRIG_LESENSE(n)     (((n) == 0) ? VDAC0_CH1_TRIG_LESENSE \
                                      : 0x0UL)
#define VDAC_FIFO_DEPTH(n)           (((n) == 0) ? VDAC0_FIFO_DEPTH \
                                      : 0x0UL)
#define VDAC_INT_PRESC_WIDTH(n)      (((n) == 0) ? VDAC0_INT_PRESC_WIDTH \
                                      : 0x0UL)
#define VDAC_RESOLUTION(n)           (((n) == 0) ? VDAC0_RESOLUTION \
                                      : 0x0UL)

/* Instance macros for WDOG */
#define WDOG(n)                      (((n) == 0) ? WDOG0   \
                                      : ((n) == 1) ? WDOG1 \
                                      : 0x0UL)
#define WDOG_NUM(ref)                (((ref) == WDOG0) ? 0   \
                                      : ((ref) == WDOG1) ? 1 \
                                      : -1)
#define WDOG_PCNUM(n)                (((n) == 0) ? WDOG0_PCNUM   \
                                      : ((n) == 1) ? WDOG1_PCNUM \
                                      : 0x0UL)

/** @} End of group EFR32FG25B221F1920IM56_Peripheral_Parameters  */

/** @} End of group EFR32FG25B221F1920IM56 */
/** @}} End of group Parts */

#ifdef __cplusplus
}
#endif
#endif
